
## Plan Result




<pre><code>Plan: 20 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.em_icp_web_pubsub_primary_connection_string
  * azurerm_key_vault_secret.local_app_insights_key
  * azurerm_key_vault_secret.local_redis_password[0]
  * azurerm_key_vault_secret.local_s2s_key
  * azurerm_resource_group.rg
  * azurerm_web_pubsub.ped_web_pubsub
  * module.api.azurerm_api_management_api.api
  * module.api.azurerm_api_management_product_api.link_to_product[0]
  * module.em-icp-api.azurerm_api_management_product.product
  * module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0]
  * module.em-icp-redis-cache[0].azurerm_redis_cache.redis
  * module.em-icp-redis-cache[0].azurerm_resource_group.cache-resourcegroup[0]
  * module.local_key_vault.azurerm_key_vault.kv
  * module.local_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.local_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.local_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;d61494c8-5014-4285-89b9-a6840f063f5e&#34;]
  * module.local_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;e38abcf8-d965-4146-ae7a-2aebb7c664fb&#34;]
  * module.local_key_vault.azurerm_key_vault_access_policy.product_team_access_policy
  * module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.policy.azurerm_api_management_api_policy.api_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.em_icp_web_pubsub_primary_connection_string will be created
  + resource "azurerm_key_vault_secret" "em_icp_web_pubsub_primary_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "em-icp-web-pubsub-primary-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.local_app_insights_key will be created
  + resource "azurerm_key_vault_secret" "local_app_insights_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "AppInsightsInstrumentationKey"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.local_redis_password[0] will be created
  + resource "azurerm_key_vault_secret" "local_redis_password" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "redis-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.local_s2s_key will be created
  + resource "azurerm_key_vault_secret" "local_s2s_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "microservicekey-em-icp"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "em-icp-aat"
      + tags     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
    }

  # azurerm_web_pubsub.ped_web_pubsub will be created
  + resource "azurerm_web_pubsub" "ped_web_pubsub" {
      + aad_auth_enabled              = true
      + capacity                      = 1
      + external_ip                   = (known after apply)
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + local_auth_enabled            = true
      + location                      = "uksouth"
      + name                          = "em-icp-webpubsub-aat"
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + public_network_access_enabled = true
      + public_port                   = (known after apply)
      + resource_group_name           = "em-icp-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + server_port                   = (known after apply)
      + sku                           = "Standard_S1"
      + tags                          = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
      + tls_client_cert_enabled       = false
      + version                       = (known after apply)

      + identity {
          + identity_ids = [
              + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/managed-identities-aat-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/rpa-aat-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + live_trace {
          + connectivity_logs_enabled = false
          + enabled                   = true
          + http_request_logs_enabled = true
          + messaging_logs_enabled    = true
        }
    }

  # module.api.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "core-api-mgmt-aat"
      + api_type              = "http"
      + display_name          = "em-icp"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "em-icp-api"
      + path                  = "em-icp-api"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "core-infra-aat"
      + revision              = "1"
      + service_url           = "http://em-icp-aat.service.core-compute-aat.internal"
      + soap_pass_through     = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "swagger-link-json"
          + content_value  = "https://raw.githubusercontent.com/hmcts/reform-api-docs/master/docs/specs/em-icp.json"
        }
    }

  # module.api.azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + product_id          = "em-icp-api"
      + resource_group_name = "core-infra-aat"
    }

  # module.em-icp-api.azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "core-api-mgmt-aat"
      + approval_required     = true
      + display_name          = "em-icp-api"
      + id                    = (known after apply)
      + product_id            = "em-icp-api"
      + published             = true
      + resource_group_name   = "core-infra-aat"
      + subscription_required = true
      + subscriptions_limit   = 20
    }

  # module.em-icp-redis-cache[0].azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "em-icp-redis-cache-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "em-icp-redis-cache-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "em-icp-redis-cache-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.em-icp-redis-cache[0].azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "C"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "em-icp-redis-cache-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "em-icp-redis-cache-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Basic"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.em-icp-redis-cache[0].azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "em-icp-redis-cache-cache-aat"
      + tags     = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
    }

  # module.local_key_vault.azurerm_key_vault.kv will be created
  + resource "azurerm_key_vault" "kv" {
      + access_policy                   = (known after apply)
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "em-icp-aat"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "em-icp-aat"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"         = "evidence-management"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/em-icp-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#em-dev-chat"
          + "environment"         = "staging"
          + "managedBy"           = "Evidence Management"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.local_key_vault.azurerm_key_vault_access_policy.creator_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      + certificate_permissions = [
          + "Create",
          + "Delete",
          + "DeleteIssuers",
          + "Get",
          + "GetIssuers",
          + "Import",
          + "List",
          + "ListIssuers",
          + "SetIssuers",
          + "Update",
          + "ManageContacts",
          + "ManageIssuers",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Create",
          + "List",
          + "Get",
          + "Delete",
          + "Update",
          + "Import",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Sign",
          + "Verify",
          + "GetRotationPolicy",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + secret_permissions      = [
          + "Set",
          + "List",
          + "Get",
          + "Delete",
          + "Recover",
          + "Purge",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.local_key_vault.azurerm_key_vault_access_policy.developer[0] will be created
  + resource "azurerm_key_vault_access_policy" "developer" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.local_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["d61494c8-5014-4285-89b9-a6840f063f5e"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "d61494c8-5014-4285-89b9-a6840f063f5e"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.local_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["e38abcf8-d965-4146-ae7a-2aebb7c664fb"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "e38abcf8-d965-4146-ae7a-2aebb7c664fb"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.local_key_vault.azurerm_key_vault_access_policy.product_team_access_policy will be created
  + resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      + certificate_permissions = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "ManageContacts",
          + "ManageIssuers",
          + "GetIssuers",
          + "ListIssuers",
          + "SetIssuers",
          + "DeleteIssuers",
          + "Recover",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
        ]
      + key_vault_id            = (known after apply)
      + object_id               = "5d9cd025-a293-4b97-a0e5-6f43efce02c0"
      + secret_permissions      = [
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.local_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be created
  + resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
      + id                             = (known after apply)
      + log_analytics_destination_type = (known after apply)
      + log_analytics_workspace_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                           = "em-icp-aat"
      + target_resource_id             = (known after apply)

      + enabled_log {
          + category = "AuditEvent"
        }
    }

  # module.policy.azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "core-api-mgmt-aat"
      + api_name            = "em-icp-api"
      + id                  = (known after apply)
      + resource_group_name = "core-infra-aat"
      + xml_content         = <<-EOT
            <policies>
                <backend>
                    <base/>
                </backend>
                <inbound>
                    <base/>
                    <choose>
                        <when condition="@(context.Request.Certificate == null)" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Missing client certificate</set-body>
                            </return-response>
                        </when>
                        <when condition="@(context.Request.Certificate.NotAfter &lt; DateTime.Now || context.Request.Certificate.NotBefore &gt; DateTime.Now || !(new string[] {&quot;&quot;,&quot;29390B7A235C692DACD93FA0AB90081867177BEC&quot;}.Any(c => c == context.Request.Certificate.Thumbprint)))" >
                            <return-response>
                                <set-status code="401" />
                                <set-body>Invalid client certificate</set-body>
                            </return-response>
                        </when>
                    </choose>
                    <rate-limit-by-key calls="3" renewal-period="15" counter-key="@(context.Subscription.Id)" />
                </inbound>
                <outbound>
                    <base/>
                </outbound>
                <on-error>
                    <base/>
                </on-error>
            </policies>
        EOT
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":939,"Program":"tfcmt","SHA1":"","Vars":{}} -->